set_property IOSTANDARD LVCMOS33 [get_ports rx_i_0]
set_property IOSTANDARD LVCMOS33 [get_ports clk_0]
set_property IOSTANDARD LVCMOS33 [get_ports reset_0]
set_property PACKAGE_PIN C4 [get_ports rx_i_0]
set_property PACKAGE_PIN E3 [get_ports clk_0]
set_property PACKAGE_PIN M17 [get_ports reset_0]

set_property PACKAGE_PIN P17 [get_ports ap_rst_0]
set_property IOSTANDARD LVCMOS33 [get_ports ap_rst_0]
set_property PACKAGE_PIN D4 [get_ports tx_o_0]
set_property IOSTANDARD LVCMOS33 [get_ports tx_o_0]

create_clock -period 20.000 -name clk_0 -waveform {0.000 10.000} [get_ports clk_0]
set_input_delay -clock [get_clocks clk_0] -min -add_delay 0.000 [get_ports ap_rst_0]
set_input_delay -clock [get_clocks clk_0] -max -add_delay 1.000 [get_ports ap_rst_0]
set_input_delay -clock [get_clocks clk_0] -min -add_delay 0.000 [get_ports reset_0]
set_input_delay -clock [get_clocks clk_0] -max -add_delay 1.000 [get_ports reset_0]
set_input_delay -clock [get_clocks clk_0] -min -add_delay 0.000 [get_ports rx_i_0]
set_input_delay -clock [get_clocks clk_0] -max -add_delay 1.000 [get_ports rx_i_0]
set_output_delay -clock [get_clocks clk_0] -min -add_delay 0.000 [get_ports tx_o_0]
set_output_delay -clock [get_clocks clk_0] -max -add_delay 1.000 [get_ports tx_o_0]

set_property IOSTANDARD LVCMOS33 [get_ports {seg_0[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {seg_0[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {seg_0[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {seg_0[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {seg_0[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {seg_0[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {seg_0[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {seg_0[0]}]

set_property PACKAGE_PIN H15 [get_ports {seg_0[0]}]
set_property PACKAGE_PIN T10 [get_ports {seg_0[1]}]
set_property PACKAGE_PIN R10 [get_ports {seg_0[2]}]
set_property PACKAGE_PIN K16 [get_ports {seg_0[3]}]
set_property PACKAGE_PIN K13 [get_ports {seg_0[4]}]
set_property PACKAGE_PIN P15 [get_ports {seg_0[5]}]
set_property PACKAGE_PIN T11 [get_ports {seg_0[6]}]
set_property PACKAGE_PIN L18 [get_ports {seg_0[7]}]

set_property IOSTANDARD LVCMOS33 [get_ports {sel_0[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {sel_0[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {sel_0[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {sel_0[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {sel_0[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {sel_0[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {sel_0[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {sel_0[0]}]

set_property PACKAGE_PIN J17 [get_ports {sel_0[0]}]
set_property PACKAGE_PIN J18 [get_ports {sel_0[1]}]
set_property PACKAGE_PIN T9 [get_ports {sel_0[2]}]
set_property PACKAGE_PIN J14 [get_ports {sel_0[3]}]
set_property PACKAGE_PIN P14 [get_ports {sel_0[4]}]
set_property PACKAGE_PIN T14 [get_ports {sel_0[5]}]
set_property PACKAGE_PIN K2 [get_ports {sel_0[6]}]
set_property PACKAGE_PIN U13 [get_ports {sel_0[7]}]

set_property PACKAGE_PIN V11 [get_ports read_flag_out_0]
set_property IOSTANDARD LVCMOS33 [get_ports read_flag_out_0]
set_output_delay -clock [get_clocks clk_0] -min -add_delay 0.000 [get_ports read_flag_out_0]
set_output_delay -clock [get_clocks clk_0] -max -add_delay 1.000 [get_ports read_flag_out_0]

set_output_delay -clock [get_clocks clk_0] -min -add_delay 0.000 [get_ports {seg_0[*]}]
set_output_delay -clock [get_clocks clk_0] -max -add_delay 1.000 [get_ports {seg_0[*]}]
set_output_delay -clock [get_clocks clk_0] -min -add_delay 0.000 [get_ports {sel_0[*]}]
set_output_delay -clock [get_clocks clk_0] -max -add_delay 1.000 [get_ports {sel_0[*]}]

set_property PACKAGE_PIN H17 [get_ports {state_out_0[0]}]
set_property PACKAGE_PIN K15 [get_ports {state_out_0[1]}]
set_property PACKAGE_PIN J13 [get_ports {state_out_0[2]}]
set_property PACKAGE_PIN N14 [get_ports {state_out_0[3]}]
set_property PACKAGE_PIN R18 [get_ports {state_out_0[4]}]
set_property PACKAGE_PIN V17 [get_ports {state_out_0[5]}]
set_property PACKAGE_PIN U17 [get_ports {state_out_0[6]}]
set_property PACKAGE_PIN U16 [get_ports {state_out_0[7]}]
set_property PACKAGE_PIN V16 [get_ports {state_out_0[8]}]
set_property PACKAGE_PIN T15 [get_ports {state_out_0[9]}]
set_property PACKAGE_PIN U14 [get_ports {state_out_0[10]}]
set_property PACKAGE_PIN T16 [get_ports {state_out_0[11]}]
set_property PACKAGE_PIN V15 [get_ports {state_out_0[12]}]
set_property PACKAGE_PIN V14 [get_ports {state_out_0[13]}]

set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[10]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[11]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[12]}]
set_property IOSTANDARD LVCMOS33 [get_ports {state_out_0[13]}]

set_output_delay -clock [get_clocks clk_0] -min -add_delay 0.000 [get_ports {state_out_0[*]}]
set_output_delay -clock [get_clocks clk_0] -max -add_delay 1.000 [get_ports {state_out_0[*]}]

set_property IOSTANDARD LVCMOS33 [get_ports {conv_out_0[0]}]
set_property PACKAGE_PIN V12 [get_ports {conv_out_0[0]}]

set_output_delay -clock [get_clocks clk_0] -min -add_delay 0.000 [get_ports {conv_out_0[*]}]
set_output_delay -clock [get_clocks clk_0] -max -add_delay 1.000 [get_ports {conv_out_0[*]}]


set_property PACKAGE_PIN J15 [get_ports {addr_0[0]}]
set_property PACKAGE_PIN L16 [get_ports {addr_0[1]}]
set_property PACKAGE_PIN M13 [get_ports {addr_0[2]}]
set_property PACKAGE_PIN R15 [get_ports {addr_0[3]}]
set_property PACKAGE_PIN R17 [get_ports {addr_0[4]}]
set_property PACKAGE_PIN T18 [get_ports {addr_0[5]}]
set_property PACKAGE_PIN U18 [get_ports {addr_0[6]}]
set_property PACKAGE_PIN R13 [get_ports {addr_0[7]}]
set_property PACKAGE_PIN T8 [get_ports {addr_0[8]}]
set_property PACKAGE_PIN U8 [get_ports {addr_0[9]}]
set_property PACKAGE_PIN R16 [get_ports {addr_0[10]}]
set_property PACKAGE_PIN T13 [get_ports {addr_0[11]}]
set_property PACKAGE_PIN H6 [get_ports {addr_0[12]}]
set_property PACKAGE_PIN U12 [get_ports {addr_0[13]}]
set_property PACKAGE_PIN U11 [get_ports {addr_0[14]}]
set_property PACKAGE_PIN V10 [get_ports {addr_0[15]}]

set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[10]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[11]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[12]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[13]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[14]}]
set_property IOSTANDARD LVCMOS33 [get_ports {addr_0[15]}]

set_property PACKAGE_PIN M18 [get_ports start_0]
set_property IOSTANDARD LVCMOS33 [get_ports start_0]





create_generated_clock -name {design_1_i/top_module_0/U0/FSM_onehot_state_reg[7]_0[0]} -source [get_ports clk_0] -divide_by 1 [get_pins {design_1_i/top_module_0/U0/FSM_onehot_state_reg[7]/Q}]
set_input_delay -clock [get_clocks clk_0] -clock_fall -min -add_delay 0.000 [get_ports {addr_0[*]}]
set_input_delay -clock [get_clocks clk_0] -clock_fall -max -add_delay 2.000 [get_ports {addr_0[*]}]
set_input_delay -clock [get_clocks clk_0] -min -add_delay 0.000 [get_ports start_0]
set_input_delay -clock [get_clocks clk_0] -max -add_delay 2.000 [get_ports start_0]
